user/tutorials/Nike/ISAT_paper/2D_shock/shockDroplet_codestream_longer_C12test_D_2d_1C_low_T_ISAT_1e_3/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            ISATVLEheRhoThermo;//ISATVLEhePsiThermo;//hePsiThermo;//HYhePsiThermo;//
    mixture         nLreactingMixture;//nLreactingMixture;//reactingMixture;//HYreactingMixture;
    transport       chung;//sutherland;//
    thermo          janaf;
    energy          sensibleInternalEnergy;//
    equationOfState PengRobinson;//perfectGas;//PengRobinson;//
    specie          specie;
}

dpdt yes;
chemistryReader foamChemistryReader;

foamChemistryFile "$FOAM_CASE/constant/chem";

//foamChemistryThermoFile "$FOAM_CASE/constant/thermo";
foamChemistryThermoFile "$FOAM_USER_DIR/etc/caseDicts/VLEcase/system/thermo";
#include"$FOAM_USER_DIR/etc/caseDicts/VLEcase/system/thermoMixture"

CHEMKINFile     "$FOAM_CASE/chemkin/chem.inp";
CHEMKINThermoFile "$FOAM_CASE/chemkin/therm.dat";
CHEMKINTransportFile "$FOAM_CASE/chemkin/transportProperties";

ISATDictFile "$FOAM_CASE/constant/ISATDict";
ISATlog true;
newFormat       yes;

inertSpecie     N2;//CO2;

inviscid true;//false;//true;
//doubleFlux false;
scheme doubleFlux;// doubleFlux //conservativeFlux // mix
phi  -0.2; 
liquids
{
    C12H26;
}
inputK false;
Kinit (898871489.0830865 28337.84530200413 0.0014273249038749681);
solids
{}





// ************************************************************************* //
